{"uniqueid":{"23":"debug1QPrJ:debugxBhSO","47":"debug1XI8z:debughtF0I","75":"debug7jWZ0:debugDksz0","99":"debugAAlIU:debugyGt2g","123":"debugat9aJ:debuguS4GJ","147":"debugc8kHP:debugoH00f","171":"debugIJUBE:debugUzhqj","195":"debugityDB:debugOmA92","221":"debugIyjLI:debuga2R41","245":"debugj8d0q:debugyZAif","269":"debugJlX7t:debugup05L","293":"debugkWeDK:debugtJbDA","317":"debuglH0Ag:debugUb22a","341":"debugRg8DP:debugDKHYC","365":"debugRH6MN:debugv2Idm","389":"debugTtOCM:debugGUFdq","415":"debugWFcHa:debugN5Afm","439":"debugxkEu1:debugRiPiq","467":"debugym4hP:debugIf95G","491":"debugYuhM3:debugdoGQl"},"phase":{"23":"POSTQUESTIONAIRE","47":"POSTQUESTIONAIRE","75":"POSTQUESTIONAIRE","99":"POSTQUESTIONAIRE","123":"POSTQUESTIONAIRE","147":"POSTQUESTIONAIRE","171":"POSTQUESTIONAIRE","195":"POSTQUESTIONAIRE","221":"POSTQUESTIONAIRE","245":"POSTQUESTIONAIRE","269":"POSTQUESTIONAIRE","293":"POSTQUESTIONAIRE","317":"POSTQUESTIONAIRE","341":"POSTQUESTIONAIRE","365":"POSTQUESTIONAIRE","389":"POSTQUESTIONAIRE","415":"POSTQUESTIONAIRE","439":"POSTQUESTIONAIRE","467":"POSTQUESTIONAIRE","491":"POSTQUESTIONAIRE"},"name":{"23":"Kat Medill","47":"Stephanie V","75":"Mike Lee","99":"","123":"Maggie","147":"Vignesh Rajmohan","171":"Kat Medill","195":"Tesca","221":"Maggie","245":"Mike Lee","269":"Stephanie V","293":"Yaxin Hu","317":"Tesca","341":"ling","365":"PK","389":"Reuben","415":"26","439":"Sarthak","467":"Reuben Aronson","491":"Sarthak"},"experienceScore":{"23":"3","47":"3","75":"4","99":"","123":"5 - Lots of experience","147":"4","171":"3","195":"5 - Lots of experience","221":"5 - Lots of experience","245":"4","269":"3","293":"5 - Lots of experience","317":"5 - Lots of experience","341":"2","365":"5 - Lots of experience","389":"","415":"5 - Lots of experience","439":"4","467":"5 - Lots of experience","491":"4"},"gender":{"23":"Female","47":"Female","75":"Male","99":"","123":"Female","147":"Male","171":"Female","195":"Female","221":"Female","245":"Male","269":"Female","293":"Female","317":"Female","341":"Female","365":"Female","389":"","415":"Female","439":"Male","467":"Male","491":"Male"},"selfDescribedGender":{"23":"","47":"","75":"","99":"","123":"","147":"","171":"","195":"","221":"","245":"","269":"","293":"","317":"","341":"","365":"","389":"","415":"","439":"","467":"why do you need gender?","491":""},"age":{"23":"21","47":"29","75":"26","99":"","123":"25","147":"20","171":"21","195":"23","221":"25","245":"26","269":"29","293":"26","317":"23","341":"21","365":"26","389":"","415":"26","439":"26","467":"4 days less than 30....","491":"26"},"difficultyScore":{"23":"5 - Moderately difficult","47":"2","75":"3","99":"","123":"4","147":"3","171":"2","195":"1 - Not Difficult","221":"5 - Moderately difficult","245":"9","269":"1 - Not Difficult","293":"3","317":"1 - Not Difficult","341":"1 - Not Difficult","365":"7","389":"","415":"1 - Not Difficult","439":"5 - Moderately difficult","467":"7","491":"2"},"hardToUnderstand":{"23":"This condition was much harder but I don't think it had anything to do with the robot's motion, just that you couldn't see the robot until it was already at your table.","47":"not really but I was not sure if it was going to show up so sometimes it caught me by surprise and I realized I had to move the cursor quickly.","75":"I used Kuri's eye gaze heavily to predict its destination. So when it moves along a linear path for a while and then it suddenly turns, it's surprising to me. ","99":"","123":"I don't think so. I think because of how I was sitting, I was pretty clear once the robot arrived in the scene to know where it was going. Also, whenever it approached me, it was always really quick, like super close to when it entered the video","147":"When it would look at me, but go somewhere else. Or when it took sharp angles.","171":"It was hard to distinguish if it was going to your table or the table right in front of you","195":"No","221":"The fact that the robot has \"eyes.\" I felt like I kept looking at where the robot was \"looking\" to help determine where it was going even though I wasn't sure if the robot's head position was being used as a way to signal the intended table.","245":"I couldn't see Kuri approaching so there were many times that it snuck up on me.","269":"The robot eyes made me feel it was looking at me sometimes so I thought it was coming my way.","293":"No","317":"","341":"","365":"Abruptness of motion","389":"Lack of eye contact","415":"No","439":"Too little time and too dark a video to stay focused on waiting for Kuri to pop out from the back. ","467":"Limited time in which to see the robot","491":"Nope this one had enough time for me to make up my mind and be confident at least in what my final confidence value was"},"easierToUnderstand":{"23":"I wouldn't have it turn so sharply once it's at your table","47":"It scared me a little when it came towards my table from the back. I would have preferred to see it move past me a little more and then turn around towards me later. I felt it \"too close\".","75":"Linear trajectories would be the most predictable (since you can perfectly predict the rest of the trajectory from just the first two seconds). ","99":"","123":"Not that I can think of","147":"Having the robot looking directly at where it was headed, and making smooth curve paths from start to destination.","171":"Can the robot have a face or eyes? ","195":"I found that I was looking at the robot's gaze to tell where it was trying to move","221":"The robot's head position being directed at the target table. I didn't mean to expect a social behavior like that from a robot, but I automatically looked at the position of the eyes as an initial indicator for intended table. In terms of motion, I honestly didn't pay much attention to it until it was pretty close to me. The actual motion didn't seem to matter much to me for guessing the target until it was close to me.","245":"Being able to see more of its trajectory as it approached me or others would be helpful.","269":"I would add like a highlighted path on the floor, like in Wall-e. ","293":"Maybe the robot can move slower and stop for a while before getting close to my table.","317":"","341":"","365":"Smoother trajectories","389":"Eye contact\/head motion","415":"The time window when the robot is in view is very short and it might be helpful if I can see the robot for a longer time to interpret its motion","439":"approaching from the front, higher brightness, audio cues maybe","467":"","491":"Expressions maybe? It seems like as a customer if I am very attentive at if a waiter will approach my table I am very keen to get their attention and get feedback on whether I was able to do so quickly. Since I as a customer am not involved in seeking the attention, the first-person view makes me a little impatient and desiring for more control over the situation."},"surprised":{"23":"","47":"it was too close to my table.","75":"There was an instance when Kuri seems like it was coming to me, but suddenly doubled back to the table before me. That was really unintuitive.","99":"","123":"Not really","147":"One time it had a sharp angle that surprised me.","171":"When it turned to face the table suddenly","195":"I was surprised when the robot would look straight ahead and past the table, only to turn at the last minute and move to my table","221":"Once it rolled up really close to my table and abruptly turned to face me. I thought it was going to go past me. Also, I think I kept forgetting that the robot's \"gaze\" wasn't an indicator of it's target location because it would \"look\" in the direction of the person at the table once it arrived at that table. It's like the eyes suddenly were exhibiting a social behavior. ","245":"No, not really","269":"Sometimes it passed by me when I thought it was heading towards me.","293":"No","317":"I was surprised when the robot would move up to me and then quickly turn its head. I would have expected the robot to look at me while moving to the table.","341":"","365":"Rotating at last minute","389":"go past the table and then turn back","415":"No","439":"not particularly, just the sneaking up made me feel like I am playing a game and made me double up my focus more","467":"","491":"in one trial it did a complete U-turn on me which was a unique case."},"expectations":{"23":"","47":"For some reason I imagined they would move in some sort of a grid, so like 90 degree angles type of movements. ","75":"Ideally how a human would move in a restaurant? But I'd give it some leeway ","99":"","123":"From the vantage point I was sitting it, it seemed to meet my expectations.","147":"I thought it would move slower, especially if it was carrying food.","171":"I didn't have many expectations but this seemed about right","195":"I expected it to be farther from the tables to avoid accidentally hitting a table","221":"I think I already touched on this. Moving while having the robot's head facing the intended table. Also, that I wouldn't make abrupt and\/or sharp turns unless necessary (like avoiding an obstacle)","245":"Ideally how a human would move in a restaurant? But I'd give it some leeway ","269":"nothing new to add.","293":"I haven't seen a robot in the restaurant. ","317":"","341":"","365":"It probably wouldn't be this clear, so a trajectory would be pretty convoluted -- \"eye contact\" seems to matter a lot.","389":"","415":"I expect the robot not to bump into things.","439":"facial gestures are I guess key to the interaction between servers and customers. A nod or a smile to indicate that the waiter will be approaching your table shortly.","467":"","491":"(covered in the points above) Expressions maybe? It seems like as a customer if I am very attentive at if a waiter will approach my table I am very keen to get their attention and get feedback on whether I was able to do so quickly. Since I as a customer am not involved in seeking the attention, the first-person view makes me a little impatient and desiring for more control over the situation."},"differences":{"23":"","47":"I think the human waiter makes sure you are able to see them fully as they approach your table most of the time. The robot moved differently, it instead went directly towards the table without fully positioning himself in sigh first. Now that I think about it sometimes waiters surprise me too but I do feel the robot was much faster and a waiter approaches tables a little bit slower.","75":"Not really to be honest","99":"","123":"I didn't notice any","147":"Human waiters move with more hop in their step.","171":"A human wouldn't take such a straight path and then turn right when it got to the table","195":"A human waiter would look at the table they were trying to reach while navigating to that table","221":"Yes, mainly that a waiter might glance at the intended table a bit while just starting to walk over and then fix their eyes (or glance repeatedly) on the target table as they got closer.","245":"Not really? I think in real life, we're able to anticipate a waiter approaching our table based on the behavior of people at our table who are facing the approaching waiter. (Though this isn't really the point of your study)","269":"nothing new to add.","293":"I didn't notice the difference. ","317":"","341":"","365":"Yeah, a human waiter might make eye contact or nod; I'd know even if they detoured, that they'd be on their way to me.","389":"","415":"I didn't notice the difference. ","439":"(same as above) facial gestures are I guess key to the interaction between servers and customers. A nod or a smile to indicate that the waiter will be approaching your table shortly.","467":"","491":"(covered in the previous condition)"},"otherComments":{"23":"I wonder how sound would affect this? I think in real life if someone is approaching from behind you rely a lot on sound. I was also a little confused by the picture of the restaurant shown at the beginning because it didn't look like the view when I was actually doing it and it took me a minute to make the connection. I also forgot there were tables behind me in both conditions so I was confused when no robot showed up.","47":"nothing to add. ","75":"","99":"","123":"The positions of the other tables vs mine made determining its target pretty easy. I would say that it was pretty quick when the robot approached my table and the other table that was close to the left edge of the frame. My reaction time kind of sucks so I'm not sure if the data I provided was super helpful. Also, I switched from using the trackpad on my computer to a mouse that I plugged in. It made it easier to avoid making accidental adjustments to the slider","147":"I think a robot waiter is an appeal in itself and even though it is significantly different from a human, it is still an effective waiter. ","171":"None","195":"","221":"I think using the slider with a mousepad on a laptop made my answers not totally consistent with my intended input. Like I had trouble keeping the slider where I wanted it (like at 50\/50 as the video was starting or accidentally moving the slider 20% in the opposite direction at the very end of the video after the robot had approached the target table)","245":"","269":"nothing new to add.","293":"","317":"","341":"","365":"a progress bar might be handy, and are you counterbalancing the order of these videos? my first n videos were the robot turning away abruptly, so my overall confidence lowered","389":"","415":"","439":"the slider labels can be switched as having \"my table\" on the right where you would usually have \"100%\".","467":"","491":"Nope these were it. Good work! :)"}}